# 1. Retrieving Data with SQL

## 1.1 Use select to retrieve data

Run below cell, this will allow you to connect to the **rexon_metals** database.

In [4]:
%load_ext sql
%config SqlMagic.autocommit=False
%config SqlMagic.autolimit=20
%config SqlMagic.displaylimit=20
%sql postgresql://user-pengfei:gv8eba5xmsw4kt2uk1mn@postgresql-124499/test

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

To retrieve data from a table, we use the key word **select ... from ...**

For example, below commands retrieve all columns and rows of table customers. Note sql is **not case-sensitive**, so the two select will output exactly the same result

In [5]:
%%sql
select * from customers limit 5;

   postgresql://user-pengfei:***@postgresql-124499/north_wind
 * postgresql://user-pengfei:***@postgresql-124499/test
5 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In [3]:
%%sql
SELECT * FROM CUSTOMERS LIMIT 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[('ALFKI', 'Alfreds Futterkiste', 'Maria Anders', 'Sales Representative', 'Obere Str. 57', 'Berlin', None, '12209', 'Germany', '030-0074321', '030-0076545'),
 ('ANATR', 'Ana Trujillo Emparedados y helados', 'Ana Trujillo', 'Owner', 'Avda. de la Constitución 2222', 'México D.F.', None, '05021', 'Mexico', '(5) 555-4729', '(5) 555-3745'),
 ('ANTON', 'Antonio Moreno Taquería', 'Antonio Moreno', 'Owner', 'Mataderos  2312', 'México D.F.', None, '05023', 'Mexico', '(5) 555-3932', None),
 ('AROUT', 'Around the Horn', 'Thomas Hardy', 'Sales Representative', '120 Hanover Sq.', 'London', None, 'WA1 1DP', 'UK', '(171) 555-7788', '(171) 555-6750'),
 ('BERGS', 'Berglunds snabbköp', 'Christina Berglund', 'Order Administrator', 'Berguvsvägen  8', 'Luleå', None, 'S-958 22', 'Sweden', '0921-12 34 65', '0921-12 34 67')]

In above example, * means all columns, customers is the name of the table.

Try to retrieve the content of table products

In [5]:
%%sql
select * from products limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(1, 'Chai', 8, 1, '10 boxes x 30 bags', 18.0, 39, 0, 10, 1),
 (2, 'Chang', 1, 1, '24 - 12 oz bottles', 19.0, 17, 40, 25, 1),
 (3, 'Aniseed Syrup', 1, 2, '12 - 550 ml bottles', 10.0, 13, 70, 25, 0),
 (4, "Chef Anton's Cajun Seasoning", 2, 2, '48 - 6 oz jars', 22.0, 53, 0, 0, 0),
 (5, "Chef Anton's Gumbo Mix", 2, 2, '36 boxes', 21.35, 0, 0, 0, 1)]

### 1.1.1 Select specific columns

We can also give column names to retrieve data from specific columns. Below command only retrieves data of column product_id and quantity_per_unit.

In [7]:
%%sql
select product_id, quantity_per_unit from products;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
77 rows affected.

[(1, '10 boxes x 30 bags'),
 (2, '24 - 12 oz bottles'),
 (3, '12 - 550 ml bottles'),
 (4, '48 - 6 oz jars'),
 (5, '36 boxes'),
 (6, '12 - 8 oz jars'),
 (7, '12 - 1 lb pkgs.'),
 (8, '12 - 12 oz jars'),
 (9, '18 - 500 g pkgs.'),
 (10, '12 - 200 ml jars'),
 (11, '1 kg pkg.'),
 (12, '10 - 500 g pkgs.'),
 (13, '2 kg box'),
 (14, '40 - 100 g pkgs.'),
 (15, '24 - 250 ml bottles'),
 (16, '32 - 500 g boxes'),
 (17, '20 - 1 kg tins'),
 (18, '16 kg pkg.'),
 (19, '10 boxes x 12 pieces'),
 (20, '30 gift boxes')]

### 1.1.2 Do operations on selected columns
We can also perform operations (e.g. mathematical operators(+,-,*,/,%), text operators(||, ),sql operators(count(), round, etc.), etc.) on a column.

For example, suppose the tax rate of a product is 15%, below command will get not only the price, but also the tax of the product

In [8]:
%%sql
select product_id, unit_price, unit_price*0.15 as tax from products;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
77 rows affected.

[(1, 18.0, 2.6999999999999997),
 (2, 19.0, 2.85),
 (3, 10.0, 1.5),
 (4, 22.0, 3.3),
 (5, 21.35, 3.2025000572204587),
 (6, 25.0, 3.75),
 (7, 30.0, 4.5),
 (8, 40.0, 6.0),
 (9, 97.0, 14.549999999999999),
 (10, 31.0, 4.6499999999999995),
 (11, 21.0, 3.15),
 (12, 38.0, 5.7),
 (13, 6.0, 0.8999999999999999),
 (14, 23.25, 3.4875),
 (15, 13.0, 1.95),
 (16, 17.45, 2.617500114440918),
 (17, 39.0, 5.85),
 (18, 62.5, 9.375),
 (19, 9.2, 1.3799999713897704),
 (20, 81.0, 12.15)]

Note, inside one operation, **you can not use the result that is calculated at the same level**, for example below query is wrong, because
tax is calculated at the same time of total_price. And there is no guaranty that the tax will finish before total_price. So total_price
can not use tax as input argument.

In [9]:
%%sql

select product_id, unit_price, unit_price*0.15 as tax, unit_price+tax as total_price from products;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
(psycopg2.errors.UndefinedColumn) column "tax" does not exist
LINE 1: ...d, unit_price, unit_price*0.15 as tax, unit_price+tax as tot...
                                                             ^

[SQL: select product_id, unit_price, unit_price*0.15 as tax, unit_price+tax as total_price from products;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [12]:
%%sql
select product_id, unit_price, unit_price*1.15 as total_price from products limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(1, 18.0, 20.7),
 (2, 19.0, 21.849999999999998),
 (3, 10.0, 11.5),
 (4, 22.0, 25.299999999999997),
 (5, 21.35, 24.552500438690185)]

**Note, don't use space in column name, alias or whatever, use _ instead. Because sql consider space as delimiter of string.**

### 1.1.3 Multiple operations on selected columns

We can also combine multi operations on a column. Below query get the total price but only keeps two digits after. For now, you don't need to understand the **:: numeric(16,2)**. That's for type casting, because origin column type is real, but function round only takes float as argument. So we need to convert the type.

In [15]:
%%sql
select product_id, unit_price, round((unit_price*1.15):: numeric(16,2),2) as total_price from products limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(1, 18.0, Decimal('20.70')),
 (2, 19.0, Decimal('21.85')),
 (3, 10.0, Decimal('11.50')),
 (4, 22.0, Decimal('25.30')),
 (5, 21.35, Decimal('24.55'))]

### 1.1.3 Rename output column

In the above example, the column unit_price and total_price are confusing. So we want to rename them as **UNTAXED_PRICE and TAXED_PRICE**.

In [18]:
%%sql
select product_id, unit_price as UNTAXED_PRICE, unit_price*1.15 as TAXED_PRICE from products limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[(1, 18.0, 20.7),
 (2, 19.0, 21.849999999999998),
 (3, 10.0, 11.5),
 (4, 22.0, 25.299999999999997),
 (5, 21.35, 24.552500438690185)]

## 1.2 Text concatenation

We have seen arithmetic operator above, we can also apply text operator on columns. For instance, you can concatenate the address, city and country fields from the CUSTOMERS table as well as put a comma and space between them to create a LOCATION value

The **||** is the text concatenation operator, it can concatenate two string to one. Below query uses two concatenation operator to concatenate
three string (i.e. city , ', ' and country).

Note certain database server do make difference between " and ' (e.g. postgresql). Use ' if you can when you specify strings in sql statement, this can avoid many unexpected errors

In [23]:
%%sql

select CONTACT_NAME, city || ', '|| country from customers limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[('Maria Anders', 'Berlin, Germany'),
 ('Ana Trujillo', 'México D.F., Mexico'),
 ('Antonio Moreno', 'México D.F., Mexico'),
 ('Thomas Hardy', 'London, UK'),
 ('Christina Berglund', 'Luleå, Sweden')]

We can concatenate as much string as you want, below example we use seven string to build a complete address.

In [21]:
%%sql
SELECT CONTACT_NAME,
address || ', ' || city || ', '|| country AS SHIP_ADDRESS
FROM CUSTOMERS limit 5;

 * postgresql://pliu:***@127.0.0.1:5432/north_wind
5 rows affected.

[('Maria Anders', 'Obere Str. 57, Berlin, Germany'),
 ('Ana Trujillo', 'Avda. de la Constitución 2222, México D.F., Mexico'),
 ('Antonio Moreno', 'Mataderos  2312, México D.F., Mexico'),
 ('Thomas Hardy', '120 Hanover Sq., London, UK'),
 ('Christina Berglund', 'Berguvsvägen  8, Luleå, Sweden')]